/**
 * 闭包的学习！
 * 
 * 闭包的优点：1方便我们进行封装，2比较灵活和方便
 * 闭包的缺点：1，比较耗性能，2空间浪费，3内存泄漏
 * 
 */


/**
 * 自调用函数
 */
(function() {

	//这里就是用到了闭包，我们在每次自调用的时候会把道歉的i和函数绑定在一起了！
	for (var i = 0; i < 4; i++) {
		!(function() {
			console.log(i);
		})()
	}


})();


/**
 * 匿名函数在运行完后不能释放传入的j 因为下面的那个方法在使用j，所以不会释放，这样会消耗内存
 */
(function() {
	var obj = {};
	for (var j = 0; j < 4; j++) {
		!(function(j) {
			obj['fun' + j] = function() {
				console.log(j);
			}
		})(j);
	}
	obj.fun1(); //4
	obj.fun2(); //4
	obj.fun3(); //4
})();
